t21/Walnut_X/Packages/.cache/Infineon.TLE987x_DFP.1.2.4.pdsc
        <file category="sourceC" name="Device\SDK\app\main.c" attr="template" select="Simple Main" condition="TLE987x" version="1.8"/> 		
     </files>
    </component>

	<!-- START: Infineon Standard Peripherals Low Level Drivers -->
    <component Cclass="Device" Cgroup="ConfigWizard" Cversion="1.8.2" condition="TLE987x">  <!-- Cversion is necessary -->
	 <description>Infineon ConfigWizard Configuration File</description>
	 <files>
        <file category="source" name="Device\SDK\cfgwiz\TLE9871QXA20\config.icwp" attr="config" condition="TLE9871QXA20" version="1.8.2"/>
        <file category="source" name="Device\SDK\cfgwiz\TLE9873QXW40\config.icwp" attr="config" condition="TLE9873QXW40" version="1.8.2"/>
        <file category="source" name="Device\SDK\cfgwiz\TLE9877QXA20\config.icwp" attr="config" condition="TLE9877QXA20" version="1.8.2"/>
        <file category="source" name="Device\SDK\cfgwiz\TLE9877QXA40\config.icwp" attr="config" condition="TLE9877QXA40" version="1.8.2"/>
        <file category="source" name="Device\SDK\cfgwiz\TLE9877QXW40\config.icwp" attr="config" condition="TLE9877QXW40" version="1.8.2"/>
        <file category="source" name="Device\SDK\cfgwiz\TLE9879QXA20\config.icwp" attr="config" condition="TLE9879QXA20" version="1.8.2"/>
        <file category="source" name="Device\SDK\cfgwiz\TLE9879QXA40\config.icwp" attr="config" condition="TLE9879QXA40" version="1.8.2"/>
        <file category="source" name="Device\SDK\cfgwiz\TLE9879QXW40\config.icwp" attr="config" condition="TLE9879QXW40" version="1.8.2"/>

        <file category="header" name="Device\SDK\cfgwiz\TLE9871QXA20\scu_defines.h" attr="config" condition="TLE9871QXA20" version="1.8.2"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9873QXW40\scu_defines.h" attr="config" condition="TLE9873QXW40" version="1.8.2"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9877QXA20\scu_defines.h" attr="config" condition="TLE9877QXA20" version="1.8.2"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9877QXA40\scu_defines.h" attr="config" condition="TLE9877QXA40" version="1.8.2"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9877QXW40\scu_defines.h" attr="config" condition="TLE9877QXW40" version="1.8.2"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9879QXA20\scu_defines.h" attr="config" condition="TLE9879QXA20" version="1.8.2"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9879QXA40\scu_defines.h" attr="config" condition="TLE9879QXA40" version="1.8.2"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9879QXW40\scu_defines.h" attr="config" condition="TLE9879QXW40" version="1.8.2"/>      

        <file category="header" name="Device\SDK\cfgwiz\common\pmu_defines.h" attr="config" condition="TLE987x" version="1.8.2"/>
		
        <file category="header" name="Device\SDK\cfgwiz\TLE9871QXA20\adc1_defines.h" attr="config" condition="TLE9871QXA20" version="1.8.2"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9873QXW40\adc1_defines.h" attr="config" condition="TLE9873QXW40" version="1.8.2"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9877QXA20\adc1_defines.h" attr="config" condition="TLE9877QXA20" version="1.8.2"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9877QXA40\adc1_defines.h" attr="config" condition="TLE9877QXA40" version="1.8.2"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9877QXW40\adc1_defines.h" attr="config" condition="TLE9877QXW40" version="1.8.2"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9879QXA20\adc1_defines.h" attr="config" condition="TLE9879QXA20" version="1.8.2"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9879QXA40\adc1_defines.h" attr="config" condition="TLE9879QXA40" version="1.8.2"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9879QXW40\adc1_defines.h" attr="config" condition="TLE9879QXW40" version="1.8.2"/>      

        <file category="header" name="Device\SDK\cfgwiz\TLE9871QXA20\adc2_defines.h" attr="config" condition="TLE9871QXA20" version="1.8.2"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9873QXW40\adc2_defines.h" attr="config" condition="TLE9873QXW40" version="1.8.2"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9877QXA20\adc2_defines.h" attr="config" condition="TLE9877QXA20" version="1.8.2"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9877QXA40\adc2_defines.h" attr="config" condition="TLE9877QXA40" version="1.8.2"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9877QXW40\adc2_defines.h" attr="config" condition="TLE9877QXW40" version="1.8.2"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9879QXA20\adc2_defines.h" attr="config" condition="TLE9879QXA20" version="1.8.2"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9879QXA40\adc2_defines.h" attr="config" condition="TLE9879QXA40" version="1.8.2"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9879QXW40\adc2_defines.h" attr="config" condition="TLE9879QXW40" version="1.8.2"/>      

        <file category="header" name="Device\SDK\cfgwiz\common\bdrv_defines.h" attr="config" condition="TLE987x" version="1.8.2"/>      

        <file category="header" name="Device\SDK\cfgwiz\TLE9871QXA20\ccu6_defines.h" attr="config" condition="TLE9871QXA20" version="1.8.2"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9873QXW40\ccu6_defines.h" attr="config" condition="TLE9873QXW40" version="1.8.2"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9877QXA20\ccu6_defines.h" attr="config" condition="TLE9877QXA20" version="1.8.2"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9877QXA40\ccu6_defines.h" attr="config" condition="TLE9877QXA40" version="1.8.2"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9877QXW40\ccu6_defines.h" attr="config" condition="TLE9877QXW40" version="1.8.2"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9879QXA20\ccu6_defines.h" attr="config" condition="TLE9879QXA20" version="1.8.2"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9879QXA40\ccu6_defines.h" attr="config" condition="TLE9879QXA40" version="1.8.2"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9879QXW40\ccu6_defines.h" attr="config" condition="TLE9879QXW40" version="1.8.2"/>      

