t21/Walnut_X/Packages/.cache/Infineon.TLE987x_DFP.1.2.4.pdsc
        <file category="header" name="Device\SDK\cfgwiz\common\csa_defines.h" attr="config" condition="TLE987x" version="1.8.2"/>      

        <file category="header" name="Device\SDK\cfgwiz\TLE9871QXA20\gpt12e_defines.h" attr="config" condition="TLE9871QXA20" version="1.8.2"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9873QXW40\gpt12e_defines.h" attr="config" condition="TLE9873QXW40" version="1.8.2"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9877QXA20\gpt12e_defines.h" attr="config" condition="TLE9877QXA20" version="1.8.2"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9877QXA40\gpt12e_defines.h" attr="config" condition="TLE9877QXA40" version="1.8.2"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9877QXW40\gpt12e_defines.h" attr="config" condition="TLE9877QXW40" version="1.8.2"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9879QXA20\gpt12e_defines.h" attr="config" condition="TLE9879QXA20" version="1.8.2"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9879QXA40\gpt12e_defines.h" attr="config" condition="TLE9879QXA40" version="1.8.2"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9879QXW40\gpt12e_defines.h" attr="config" condition="TLE9879QXW40" version="1.8.2"/>      

        <file category="header" name="Device\SDK\cfgwiz\common\int_defines.h" attr="config" condition="TLE987x" version="1.8.2"/>      
        <file category="header" name="Device\SDK\cfgwiz\common\isr_defines.h" attr="config" condition="TLE987x" version="1.8.2"/>      
        <file category="header" name="Device\SDK\cfgwiz\common\lin_defines.h" attr="config" condition="TLE987x" version="1.8.2"/>      
        <file category="header" name="Device\SDK\cfgwiz\common\mon_defines.h" attr="config" condition="TLE987x" version="1.8.2"/>      
        <file category="header" name="Device\SDK\cfgwiz\common\port_defines.h" attr="config" condition="TLE987x" version="1.8.2"/>      

        <file category="header" name="Device\SDK\cfgwiz\TLE9871QXA20\ssc_defines.h" attr="config" condition="TLE9871QXA20" version="1.8.2"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9873QXW40\ssc_defines.h" attr="config" condition="TLE9873QXW40" version="1.8.2"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9877QXA20\ssc_defines.h" attr="config" condition="TLE9877QXA20" version="1.8.2"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9877QXA40\ssc_defines.h" attr="config" condition="TLE9877QXA40" version="1.8.2"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9877QXW40\ssc_defines.h" attr="config" condition="TLE9877QXW40" version="1.8.2"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9879QXA20\ssc_defines.h" attr="config" condition="TLE9879QXA20" version="1.8.2"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9879QXA40\ssc_defines.h" attr="config" condition="TLE9879QXA40" version="1.8.2"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9879QXW40\ssc_defines.h" attr="config" condition="TLE9879QXW40" version="1.8.2"/>      

        <file category="header" name="Device\SDK\cfgwiz\TLE9871QXA20\timer2x_defines.h" attr="config" condition="TLE9871QXA20" version="1.8.2"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9873QXW40\timer2x_defines.h" attr="config" condition="TLE9873QXW40" version="1.8.2"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9877QXA20\timer2x_defines.h" attr="config" condition="TLE9877QXA20" version="1.8.2"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9877QXA40\timer2x_defines.h" attr="config" condition="TLE9877QXA40" version="1.8.2"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9877QXW40\timer2x_defines.h" attr="config" condition="TLE9877QXW40" version="1.8.2"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9879QXA20\timer2x_defines.h" attr="config" condition="TLE9879QXA20" version="1.8.2"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9879QXA40\timer2x_defines.h" attr="config" condition="TLE9879QXA40" version="1.8.2"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9879QXW40\timer2x_defines.h" attr="config" condition="TLE9879QXW40" version="1.8.2"/>      

        <file category="header" name="Device\SDK\cfgwiz\TLE9871QXA20\timer3_defines.h" attr="config" condition="TLE9871QXA20" version="1.8.2"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9873QXW40\timer3_defines.h" attr="config" condition="TLE9873QXW40" version="1.8.2"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9877QXA20\timer3_defines.h" attr="config" condition="TLE9877QXA20" version="1.8.2"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9877QXA40\timer3_defines.h" attr="config" condition="TLE9877QXA40" version="1.8.2"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9877QXW40\timer3_defines.h" attr="config" condition="TLE9877QXW40" version="1.8.2"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9879QXA20\timer3_defines.h" attr="config" condition="TLE9879QXA20" version="1.8.2"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9879QXA40\timer3_defines.h" attr="config" condition="TLE9879QXA40" version="1.8.2"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9879QXW40\timer3_defines.h" attr="config" condition="TLE9879QXW40" version="1.8.2"/>      

        <file category="header" name="Device\SDK\cfgwiz\TLE9871QXA20\uart_defines.h" attr="config" condition="TLE9871QXA20" version="1.8.2"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9873QXW40\uart_defines.h" attr="config" condition="TLE9873QXW40" version="1.8.2"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9877QXA20\uart_defines.h" attr="config" condition="TLE9877QXA20" version="1.8.2"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9877QXA40\uart_defines.h" attr="config" condition="TLE9877QXA40" version="1.8.2"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9877QXW40\uart_defines.h" attr="config" condition="TLE9877QXW40" version="1.8.2"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9879QXA20\uart_defines.h" attr="config" condition="TLE9879QXA20" version="1.8.2"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9879QXA40\uart_defines.h" attr="config" condition="TLE9879QXA40" version="1.8.2"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9879QXW40\uart_defines.h" attr="config" condition="TLE9879QXW40" version="1.8.2"/>      

        <file category="header" name="Device\SDK\cfgwiz\common\dma_defines.h" attr="config" condition="TLE987x" version="1.8.2"/>      

        <file category="source" name="Device\SDK\cfgwiz\script\IFX_ePower.xml" attr="config" condition="TLE987x" version="1.2.0"/>      
     </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="SCU" Cversion="0.2.9" condition="TLE987x CMSIS Device">
      <description>System Control Unit (SCU) driver for TLE987x</description>
      <files>
        <file category="include" name="Device\SDK\inc\"/>
        <file category="source"  name="Device\SDK\src\scu.c"/>      
      </files>
    </component>

