t21/Walnut_X/Packages/.cache/Infineon.TLE987x_DFP.1.2.4.pdsc
	<example name="BLDC_Block_Commutation_HALL + LIN" doc="Abstract.txt" folder="Boards\Infineon\TLE9879_EvalKit\BLDC_BC_HALL_over_LIN\">
      <description>BLDC Motor Drive with Block Commution with HALL Sensor controlled over LIN</description>
      <board name="TLE9879 EvalKit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="BldcBcHallLIN.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
		<component Cclass="Device" Cgroup="SDK" Csub="SCU"/>
		<component Cclass="Device" Cgroup="SDK" Csub="WDT1"/>
		<component Cclass="Device" Cgroup="SDK" Csub="GPT12E"/>
		<component Cclass="Device" Cgroup="SDK" Csub="CCU6"/>
		<component Cclass="Device" Cgroup="SDK" Csub="BDRV"/>
		<component Cclass="Device" Cgroup="SDK" Csub="ISR"/>
		<component Cclass="Device" Cgroup="SDK" Csub="INT"/>
		<component Cclass="Device" Cgroup="SDK" Csub="LIN"/>
		<component Cclass="Device" Cgroup="SDK" Csub="TIMER2x"/>
		<component Cclass="Device" Cgroup="SDK" Csub="WDT1"/>
		<component Cclass="Device" Cgroup="SDK" Csub="UART"/>
		<component Cclass="Device" Cgroup="SDK" Csub="PORT"/>
		<component Cclass="Device" Cgroup="SDK" Csub="BOOTROM"/>
        <category>Getting Started</category>
        <category>SDK</category>
      </attributes>
    </example>

	<example name="NVM Data Flash Handling" doc="Abstract.txt" folder="Boards\Infineon\TLE9879_EvalKit\NVM_Data_Flash_Handling\">
      <description>NVM Data Flash page write with error handling</description>
      <board name="TLE9879 EvalKit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="NVM_Data_Flash_Handling.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
		<component Cclass="Device" Cgroup="SDK" Csub="SCU"/>
		<component Cclass="Device" Cgroup="SDK" Csub="WDT1"/>
		<component Cclass="Device" Cgroup="SDK" Csub="ISR"/>
		<component Cclass="Device" Cgroup="SDK" Csub="INT"/>
		<component Cclass="Device" Cgroup="SDK" Csub="WDT1"/>
		<component Cclass="Device" Cgroup="SDK" Csub="BOOTROM"/>
		<component Cclass="Device" Cgroup="SDK" Csub="PORT"/>
		<component Cclass="Device" Cgroup="SDK" Csub="ADC2"/>
        <category>Getting Started</category>
        <category>SDK</category>
      </attributes>
    </example>

	<example name="DMA UART TTY" doc="Abstract.txt" folder="Boards\Infineon\TLE9879_EvalKit\DMA_UART_TTY\">
      <description>UART2 sends data triggered by DMA</description>
      <board name="TLE9879 EvalKit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="DMA_UART_TTY.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
		<component Cclass="Device" Cgroup="SDK" Csub="SCU"/>
		<component Cclass="Device" Cgroup="SDK" Csub="WDT1"/>
		<component Cclass="Device" Cgroup="SDK" Csub="ISR"/>
		<component Cclass="Device" Cgroup="SDK" Csub="INT"/>
		<component Cclass="Device" Cgroup="SDK" Csub="WDT1"/>
		<component Cclass="Device" Cgroup="SDK" Csub="BOOTROM"/>
		<component Cclass="Device" Cgroup="SDK" Csub="PORT"/>
		<component Cclass="Device" Cgroup="SDK" Csub="DMA"/>
		<component Cclass="Device" Cgroup="SDK" Csub="GPT12E"/>
		<component Cclass="Device" Cgroup="SDK" Csub="MON"/>
		<component Cclass="Device" Cgroup="SDK" Csub="UART"/>
        <category>Getting Started</category>
        <category>SDK</category>
      </attributes>
    </example>

	<example name="DMA ADC1 Sequence" doc="Abstract.txt" folder="Boards\Infineon\TLE9879_EvalKit\DMA_ADC1_Seq\">
      <description>ADC1 triggers DMA after sequence is done</description>
      <board name="TLE9879 EvalKit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="DMA_ADC1_Seq.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
		<component Cclass="Device" Cgroup="SDK" Csub="SCU"/>
		<component Cclass="Device" Cgroup="SDK" Csub="WDT1"/>
		<component Cclass="Device" Cgroup="SDK" Csub="ISR"/>
		<component Cclass="Device" Cgroup="SDK" Csub="INT"/>
		<component Cclass="Device" Cgroup="SDK" Csub="WDT1"/>
		<component Cclass="Device" Cgroup="SDK" Csub="BOOTROM"/>
		<component Cclass="Device" Cgroup="SDK" Csub="DMA"/>
		<component Cclass="Device" Cgroup="SDK" Csub="ADC1"/>
		<component Cclass="Device" Cgroup="SDK" Csub="CSA"/>
        <category>Getting Started</category>
        <category>SDK</category>
      </attributes>
    </example>

	<example name="DMA SPI" doc="Abstract.txt" folder="Boards\Infineon\TLE9879_EvalKit\DMA_SPI\">
      <description>Sends data through SPI using DMA</description>
      <board name="TLE9879 EvalKit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="SPI_DMA.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
		<component Cclass="Device" Cgroup="SDK" Csub="SCU"/>
		<component Cclass="Device" Cgroup="SDK" Csub="WDT1"/>
		<component Cclass="Device" Cgroup="SDK" Csub="ISR"/>
		<component Cclass="Device" Cgroup="SDK" Csub="INT"/>
		<component Cclass="Device" Cgroup="SDK" Csub="WDT1"/>
		<component Cclass="Device" Cgroup="SDK" Csub="BOOTROM"/>
		<component Cclass="Device" Cgroup="SDK" Csub="DMA"/>
		<component Cclass="Device" Cgroup="SDK" Csub="SSC"/>
		<component Cclass="Device" Cgroup="SDK" Csub="PORT"/>
        <category>Getting Started</category>
        <category>SDK</category>
      </attributes>
    </example>
  </examples>
  
</package>
